# Data Analyst

# Pandas

In [47]:
# Pandas is a python library for data analysis
import pandas as pd

# Series

In [ ]:
# Series
# Syntax : s=pd.Series(data) or s=pd.Series(data,index)

In [4]:
import pandas as pd
l=[1,2,3]
s=pd.Series(l)
s

0    1
1    2
2    3
dtype: int64

In [5]:
import pandas as pd
l=[1,2,3]
s=pd.Series(l,index=["a","b","c"])
s

a    1
b    2
c    3
dtype: int64

# Data Accessibility

In [4]:
import pandas as pd
data={"Name":["rakshi","rashmi"],"Age":[21,15]}
df=pd.DataFrame(data)
df

     Name  Age
0  rakshi   21
1  rashmi   15

In [9]:
# three ways to access the data
# 1.dot operator
# You can access a column as if it were an attribute of the dataframe
print(df.Name)

0    rakshi
1    rashmi
Name: Name, dtype: object

In [11]:
# 2.square operator
# You can access a column by passing its name as string
print(df["Name"])

0    rakshi
1    rashmi
Name: Name, dtype: object

In [13]:
# 3.Doble Square brackets
# If you want the result as a dataframe (not just a series)
print(df[["Name"]])
# reurns a dataframe with one column instead a series

     Name
0  rakshi
1  rashmi

# loc and iloc

In [ ]:
# Both are used for row and column selection, but the difference is label-based vs integer-based indexing

In [24]:
# create df
d={"names":["rakshi","rashmi","kiran","punarv"],"percentage":[80,85,95,89]}
df=pd.DataFrame(d,index=["r1","r2","r3","r4"])
df

     names  percentage
r1  rakshi          80
r2  rashmi          85
r3   kiran          95
r4  punarv          89

In [26]:
# loc means label-based indexing
# You can use row label like ("r1","r2"), and column names like ("names","percentage")
# syntax : df.loc[rows,columns]
# example: Select row with index label "r2"
:df.loc["r2"]

names         rashmi
percentage        85
Name: r2, dtype: object

In [30]:
df.loc["r2":"r4","percentage"]

r2    85
r3    95
r4    89
Name: percentage, dtype: int64

In [31]:
df.loc["r1":"r3"]

     names  percentage
r1  rakshi          80
r2  rashmi          85
r3   kiran          95

In [35]:
# iloc means integer-based indexing
# You can use row  numbers like (0,1,2--) and columns numbers like (0,1,2,3--)
# syntax:df.iloc[row,columns]
# example: 
df.iloc[0]

names         rakshi
percentage        80
Name: r1, dtype: object

In [36]:
df.iloc[1]

names         rashmi
percentage        85
Name: r2, dtype: object

In [41]:
df.iloc[0:4]

     names  percentage
r1  rakshi          80
r2  rashmi          85
r3   kiran          95
r4  punarv          89

In [38]:
df.iloc[0:3,0]

r1    rakshi
r2    rashmi
r3     kiran
Name: names, dtype: object

In [40]:
df.iloc[0:3,1]

r1    80
r2    85
r3    95
Name: percentage, dtype: int64

In [45]:
df.iloc[1,0]

'rashmi'

In [46]:
df.iloc[[0,2],[0,1]]

     names  percentage
r1  rakshi          80
r3   kiran          95

# Adding new values to Existing table

In [ ]:
# You can directly assign a list/series to a new column

In [3]:
# create df
import pandas as pd
d={
    "Names":["Rakshi","Rashmi","Kiran","Punarv"],
    "Percentage":[82,70,75,95]
}
df1=pd.DataFrame(d)
df1
# Syntax:df["column_name"]=["values"]
# Add a new column "Grade"
df1["Grade"]=["A","B","B+","A+"]
df1

    Names  Percentage Grade
0  Rakshi          82     A
1  Rashmi          70     B
2   Kiran          75    B+
3  Punarv          95    A+

In [4]:
# Syntax for adding single row: df.loc[index]=[----]
# Add new row at index 4
df1.loc[4]=["Arun",65,"C"]
df1

    Names  Percentage Grade
0  Rakshi          82     A
1  Rashmi          70     B
2   Kiran          75    B+
3  Punarv          95    A+
4    Arun          65     C

In [5]:
# Syntax for multiple rows: pd.concat([df,new_df])
# example:
# create df
new_data=pd.DataFrame({
    "Names":["ramya","kavya"],
    "Percentage":[80,81],
    "Grade":["A","A"]
})
df2 = pd.concat([df1, new_data], ignore_index=True)
print(df2)

    Names  Percentage Grade
0  Rakshi          82     A
1  Rashmi          70     B
2   Kiran          75    B+
3  Punarv          95    A+
4    Arun          65     C
5   ramya          80     A
6   kavya          81     A

# Delect Columns

In [6]:
# In pandas, we usually use the .drop() method to delect columns
# example:
import pandas as pd
data={
    "Names":["Nandini","Ranjitha","Thanu"],
    "Age":[22,21,21],
    "City":["Mysore","Nagamangala","Mandya"],
    "Salary":[25000,20000,15000]
}
df3=pd.DataFrame(data,index=[1,2,3])
df3

      Names  Age         City  Salary
1   Nandini   22       Mysore   25000
2  Ranjitha   21  Nagamangala   20000
3     Thanu   21       Mandya   15000

In [7]:
print(df3.columns)

Index(['Names', 'Age', 'City', 'Salary'], dtype='object')

In [9]:
# Delete the city column
df3=df3.drop("City",axis=1)
print(df3)

      Names  Age  Salary
1   Nandini   22   25000
2  Ranjitha   21   20000
3     Thanu   21   15000

In [110]:
# Delete Multiple columns
df=df.drop(["Names","Age",],axis=1)
df

          City  Salary
1       Mysore   25000
2  Nagamangala   20000
3       Mandya   15000

In [128]:
df

      Names  Age  Salary
1   Nandini   22   25000
2  Ranjitha   21   20000
3     Thanu   21   15000

# Rename the column names

In [22]:
# use .rename() method
# syntax: df.rename(columns={"name":"full_name"}
import pandas as pd
d={
    "Names":["Asha","Ravi","Kiran"],
    "Age":[21,22,20],
    "Marks":[83,90,78]
}
df4=pd.DataFrame(d)
df4

   Names  Age  Marks
0   Asha   21     83
1   Ravi   22     90
2  Kiran   20     78

In [23]:
# Rename the single column
df4.rename(columns={"Marks":"Score"},inplace=True)
df4

   Names  Age  Score
0   Asha   21     83
1   Ravi   22     90
2  Kiran   20     78

In [26]:
# Rename all column at once
df4.columns=["Full_Name","Years","Score"]
df4

  Full_Name  Years  Score
0      Asha     21     83
1      Ravi     22     90
2     Kiran     20     78

In [29]:
# Rename with inplace (Permanent change)
df4.rename(columns={"Age":"Year"}, inplace=True)
df4

  Full_Name  Years  Score
0      Asha     21     83
1      Ravi     22     90
2     Kiran     20     78

# Missing Value Imputation

In [ ]:
# In pandas, missing value imputation means filling in the NaN (Not a Number) or none values with some approxiate replacement

In [30]:
d={
    "Names":["Hamsa","Varu","Punarv","Bhuvik"],
    "Age":[20,None,23,None],
    "Salary":[20000,45000,34000,50000]
}
df5=pd.DataFrame(d)
df5

    Names   Age  Salary
0   Hamsa  20.0   20000
1    Varu   NaN   45000
2  Punarv  23.0   34000
3  Bhuvik   NaN   50000

In [31]:
# count missing value per column
print(df5.isnull().sum())

Names     0
Age       2
Salary    0
dtype: int64

In [32]:
# Drop rows with any missing values
df5.dropna()

    Names   Age  Salary
0   Hamsa  20.0   20000
2  Punarv  23.0   34000

In [33]:
# Drop column with missing values
df5.dropna(axis=1)

    Names  Salary
0   Hamsa   20000
1    Varu   45000
2  Punarv   34000
3  Bhuvik   50000

In [38]:
# Replace all NaN with 0
df5.fillna(0)

    Names   Age  Salary
0   Hamsa  20.0   20000
1    Varu   0.0   45000
2  Punarv  23.0   34000
3  Bhuvik   0.0   50000

In [50]:
# Replace NaN in age column with 18
df5["Age"].fillna(18)
df5

    Names   Age  Salary
0   Hamsa  20.0   20000
1    Varu  18.0   45000
2  Punarv  23.0   34000
3  Bhuvik  18.0   50000

In [60]:
# Fill with column mean()
df5["Age"].fillna(df5["Age"].mean())
df5

    Names   Age  Salary
0   Hamsa  20.0   20000
1    Varu  18.0   45000
2  Punarv  23.0   34000
3  Bhuvik  18.0   50000

In [59]:
# Fill with column median()
df5["Salary"].fillna(df5["Salary"].median())

0    20000
1    45000
2    34000
3    50000
Name: Salary, dtype: int64

# Forward Fill And Backward Fill (Propagate Values)

In [11]:
# Forward Fill
# Takes the last known value and it forward to fill the next missing cell
# Think of it as: "Repeat the previous value"
import pandas as pd
d={"A":[1,None,None,4,None,6]}
df6=pd.DataFrame(d)
print("Orginal Data:")
df6

Orginal Data:

     A
0  1.0
1  NaN
2  NaN
3  4.0
4  NaN
5  6.0

In [12]:
print("Forward Fill:")
print(df6.fillna(method="ffill"))

Forward Fill:
     A
0  1.0
1  1.0
2  1.0
3  4.0
4  4.0
5  6.0

C:\Users\User\AppData\Local\Temp\ipykernel_30748\2878726631.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df6.fillna(method="ffill"))

In [14]:
print("\n Backward Fill:")
print(df6.fillna(method="bfill"))

 Backward Fill:
     A
0  1.0
1  4.0
2  4.0
3  4.0
4  6.0
5  6.0

C:\Users\User\AppData\Local\Temp\ipykernel_30748\2122931014.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df6.fillna(method="bfill"))

In [ ]:
# Summary
# dropna: Remove the missing values
# fillna(mean()/median()/mode())--->stastical imputation
# ffill and bfill: propagate nearest value
# Interpolate: estimate missing values (

# Map And Replace

In [ ]:
# In pandas,both map() and replace() are used totransform or modify values in a series or Dataframe column.But they are slightly different

In [1]:
# Map()
# works only on a series (one cloumn)
# used for elemnts-wise transformations
# accepts a function,dictionary or series for mapping
import pandas as pd
# Sample Data
d={
    "Name":["Alice","Bob","Charlie","David"],
    "Gender":["F","M","M","F"]
}
df6=pd.DataFrame(d)
df6

      Name Gender
0    Alice      F
1      Bob      M
2  Charlie      M
3    David      F

In [3]:
# Using dictionary with map()
df6["Gender"]=df6["Gender"].map({"M":"Male","F":"Female"})
df6

      Name  Gender
0    Alice  Female
1      Bob    Male
2  Charlie    Male
3    David  Female

In [ ]:
# Replace()
# works on series and dataframe (multiple column)
# more flexible than map()
# can replace single value,multiple values, or even use regex

In [4]:
# Replace values in column
df6["Name"]=df6["Name"].replace({"Alice":"Alicia","Bob":"Boddy"})
df6

      Name  Gender
0   Alicia  Female
1    Boddy    Male
2  Charlie    Male
3    David  Female

In [ ]:
# Append Function to add new data
# .append() function ws used to earlier to add new row of data to a DF
# Note: .append() is deprecated in recent pandas version (>=1.4.0)
# Syntax:
# append new row
# Syntax: df.append(new_data,ignore_index=True)
# Syntax: df=pd.concat([df,new_row],ignore_index=Ture)

In [21]:
import pandas as pd
#original DataFrame
df7=pd.DataFrame({
    "Name":["Rakshi","Rashmi"],
    "Age":[21,15]
})
# New data as (DataFrame)
new_data=pd.DataFrame({
    "Name":["Punarv"],
    "Age":[2]
})
#append
pd.concat([df7,new_data],ignore_index=True)

     Name  Age
0  Rakshi   21
1  Rashmi   15
2  Punarv    2

In [22]:
df7.loc[len(df7)]={"Name":"Lakshmi","Age":45}
df7

      Name  Age
0   Rakshi   21
1   Rashmi   15
2  Lakshmi   45

# Merge

In [ ]:
# works like a SQL joins (inner,left,right,outer)
# Flexible: you can join on one or more columns
# Combines DataFrame based on common columns or indexes

In [2]:
import pandas as pd
df9=pd.DataFrame({
        "Id":[1,2,3],
         "Names":["A","B","C"]
})
df10=pd.DataFrame({
    "Id":[1,2,4],
    "Score":[90,80,70]
})
# Merge
merged=pd.merge(df9,df10, on="Id", how="inner")
merged

   Id Names  Score
0   1     A     90
1   2     B     80

In [3]:
merged=pd.merge(df9,df10, on="Id", how="outer")
merged

   Id Names  Score
0   1     A   90.0
1   2     B   80.0
2   3     C    NaN
3   4   NaN   70.0

In [4]:
merged=pd.merge(df9,df10, on="Id", how="left")
merged

   Id Names  Score
0   1     A   90.0
1   2     B   80.0
2   3     C    NaN

In [5]:
merged=pd.merge(df9,df10, on="Id", how="right")
merged

   Id Names  Score
0   1     A     90
1   2     B     80
2   4   NaN     70

# JOIN

In [6]:
df9=pd.DataFrame({"Names":["A","B","C"]}, index=[1,2,3])
df10=pd.DataFrame({"Score":[90,80,70]}, index=[1,2,4])
joined=df9.join(df10, how="inner")
joined

  Names  Score
1     A     90
2     B     80

# Conditional Filtering

In [ ]:
# It means selecting rows from a dataset (DataFrame) based on a condition (or multiple condition)

In [2]:
import pandas as pd 
d={"name":["a","b","c","d","e"],"per":[89,56,78,45,60]}
df11=pd.DataFrame(d)
df11

  name  per
0    a   89
1    b   56
2    c   78
3    d   45
4    e   60

In [7]:
# Filtering with single codition
df11[df11.per<70]

  name  per
1    b   56
3    d   45
4    e   60

In [ ]:
# Filtering with Multiple condition
# you can combine cindition with:
# &---> AND
# |---> OR
# ~---> NOT

In [8]:
df11[(df11.per>60) & (df11.per<80)]

  name  per
2    c   78

In [11]:
# using query
df11.query("per>50")

  name  per
0    a   89
1    b   56
2    c   78
4    e   60